{
  "title": "Author’s Tone & Purpose",
  "level": "Intermediate",
  "description": "Understand the author's attitude and purpose in writing passages. Learn to detect the tone and identify the reason behind the text. This lesson provides examples, step-by-step guidance, and practice questions with explanations to ensure understanding.",
  "content": [
    {
      "heading": "Introduction",
      "text": "The tone of a passage reflects the author's attitude toward the subject. It can be positive, negative, neutral, humorous, sarcastic, or serious. The purpose explains why the author wrote the passage — to inform, persuade, entertain, or explain."
    },
    {
      "heading": "Key Concepts",
      "text": "- Tone: The emotional attitude or mood conveyed by the author.\n- Purpose: The reason the author wrote the passage.\n\nTips:\n1. Look at word choice and punctuation.\n2. Consider the audience and context.\n3. Identify whether the author aims to inform, persuade, entertain, or explain."
    },
    {
      "heading": "Step-by-Step Approach",
      "text": "1. Read the passage carefully.\n2. Note words or phrases showing emotion.\n3. Determine the overall attitude (tone).\n4. Identify the author's goal or reason for writing (purpose).\n5. Match tone and purpose to the question asked."
    },
    {
      "heading": "Example Question",
      "text": "Sentence: 'I cannot believe how beautiful the sunset is!'\n\nQuestion: What is the author's tone?",
      "options": [
        "A) Angry",
        "B) Excited",
        "C) Indifferent",
        "D) Sad"
      ],
      "answer": "B",
      "hint": "Notice the exclamation mark and positive adjective 'beautiful'.",
      "explanation": "The exclamation and the word 'beautiful' indicate excitement, showing a positive and enthusiastic tone."
    },
    {
      "heading": "Practice Questions",
      "text": "Try these questions to test your understanding of tone and purpose."
    },
    {
      "heading": "Question 1",
      "text": "Passage: 'The government must act now to prevent climate change before it’s too late.'\n\nQuestion: What is the author's purpose?",
      "options": [
        "A) Entertain",
        "B) Inform",
        "C) Persuade",
        "D) Describe"
      ],
      "answer": "C",
      "hint": "Look for persuasive language urging action.",
      "explanation": "The passage urges action and emphasizes urgency, so the author's purpose is to persuade the reader."
    },
    {
      "heading": "Question 2",
      "text": "Passage: 'The cat slept peacefully on the windowsill as the sun rose.'\n\nQuestion: What is the author's tone?",
      "options": [
        "A) Calm",
        "B) Excited",
        "C) Angry",
        "D) Frustrated"
      ],
      "answer": "A",
      "hint": "Consider the words describing the scene.",
      "explanation": "Words like 'peacefully' and the calm imagery indicate a serene, calm tone."
    },
    {
      "heading": "Summary",
      "text": "Tone reveals the author’s attitude; purpose reveals the author’s reason for writing. Paying attention to word choice, punctuation, and context helps in identifying both accurately."
    }
  ]
}
