{
  "title": "Main Idea & Central Theme",
  "level": "Intermediate",
  "description": "Learn to identify the main idea and central theme of passages. This lesson provides step-by-step guidance, examples, and practice questions with detailed explanations to ensure understanding.",
  "content": [
    {
      "heading": "Introduction",
      "text": "The main idea is the primary point the author wants to communicate. The central theme is the underlying message or lesson. Understanding both is crucial for reading comprehension."
    },
    {
      "heading": "Key Concepts",
      "text": "- Main Idea: What the passage is mainly about.\n- Central Theme: The deeper message or lesson.\n\nTips:\n1. Check first and last sentences.\n2. Identify repeated ideas.\n3. Ask: 'What is the author trying to convey overall?'"
    },
    {
      "heading": "Step-by-Step Approach",
      "text": "1. Read the passage carefully.\n2. Summarize each paragraph.\n3. Look for patterns or recurring ideas.\n4. Determine the main idea.\n5. Identify the central theme."
    },
    {
      "heading": "Example Passage",
      "text": "Passage: 'Regular exercise improves both physical and mental health. People who exercise regularly have more energy, better focus, and improved mood.'\n\nMain Idea: Exercise benefits physical and mental health.\nCentral Theme: Maintaining a healthy lifestyle enhances overall well-being."
    },
    {
      "heading": "Practice Questions",
      "text": "Try these questions to test your understanding."
    },
    {
      "heading": "Question 1",
      "text": "Passage: 'Eating a balanced diet contributes to long-term health benefits. It reduces the risk of diseases and promotes energy throughout the day.'\n\nQuestion: Identify the main idea and central theme.",
      "options": [
        "A) Eating any food is fine for health",
        "B) Eating a balanced diet promotes long-term health",
        "C) Exercising daily is more important than diet",
        "D) Only eating fruits ensures health"
      ],
      "answer": "B",
      "hint": "Focus on what the passage mainly talks about: the diet and its benefits.",
      "explanation": "The main idea is that a balanced diet promotes long-term health. The central theme is that healthy habits improve overall life quality."
    },
    {
      "heading": "Question 2",
      "text": "Passage: 'Volunteering in your community teaches empathy and responsibility. People who volunteer often feel more connected and satisfied.'\n\nQuestion: Identify the main idea and central theme.",
      "options": [
        "A) Volunteering is only for career building",
        "B) Volunteering teaches empathy and responsibility",
        "C) Only adults should volunteer",
        "D) Volunteering is a waste of time"
      ],
      "answer": "B",
      "hint": "What does volunteering teach the people doing it?",
      "explanation": "The main idea is that volunteering teaches empathy and responsibility. The central theme is that helping others enhances personal growth and fulfillment."
    },
    {
      "heading": "Summary",
      "text": "Main idea tells you what the passage is about. Central theme explains the broader message. Practice using these examples to reinforce your understanding."
    }
  ]
}
